[  
  {"id":1,"title":"What This Course Is About","purpose":"Understand the course goal: short lessons with a quiz to help learning.","study":["Welcome! This course is a short, friendly guide about Christianity for beginners, people who are curious, or those with doubts.","We are not trying to make you join anything. Instead, we want to help you understand ideas clearly so you can decide for yourself.","Each unit focuses on one topic. You’ll get short paragraphs that stick to main points, a short Bible verse or two, and a tiny quiz.","The language will be plain and everyday. If we use terms that sound churchy, we’ll explain them simply.","The quizzes are simple checks to help you remember and think, not tests. They include quick explanations.","You may have questions or doubts. That’s normal. We’ll be honest and give ways to explore further."],"verses":[{"ref":"John 3:16 NLT","text":"For God loved the world so much that he gave his one and only Son, so that everyone who believes in him will not be lost but have eternal life."},{"ref":"Matthew 7:7 NLT","text":"Ask, and you will receive. Seek, and you will find. Knock, and the door will be opened to you."}],"quiz":[{"type":"tf","q":"This course wants to force you to join a church.","correct":false,"explanation":"False. The course aims to explain Christianity so you can decide for yourself."},{"type":"mc","q":"How long should a unit take?","options":["5–10 minutes","1–2 hours","A full day"],"correct":0,"explanation":"Units are short and focused so you can learn a bit at a time."},{"type":"tf","q":"The quizzes are meant to shame you.","correct":false,"explanation":"False. Quizzes help you remember and learn."},{"type":"mc","q":"What will each unit include?","options":["Short study, 1–2 verses, and a short quiz","Long essays only for experts","Only videos and no text"],"correct":0,"explanation":"That’s the simple, consistent format."},{"type":"mc","q":"If you don’t understand a term, what should you expect?","options":["The course will explain it simply","You’ll be left to look it up","The course will avoid every important term"],"correct":0,"explanation":"The tone is friendly and clarifies church words when needed."}]},

  {"id":2,"title":"Who Is God? (Overview)","purpose":"A plain summary of God from a Christian view.","study":["Christians call God the creator and keeper of everything. Many say God is loving, fair, and near.","God is not far away. Many Christians say God cares about people.","Different churches focus on different things, but most say God is good and wants a relationship with people.","You don't need church words to start; this course will explain key words simply.","Thinking about God brings questions. That’s normal.","We will use clear examples and simple explanations so you can form your own view."],"verses":[{"ref":"Psalm 100:5 NLT","text":"The Lord is good. His love lasts forever, and he is faithful to all who trust him."}],"quiz":[{"type":"tf","q":"Christians describe God as a caring creator.","correct":true,"explanation":"True — Christians often speak of God as loving and creating the world."},{"type":"mc","q":"Which is a common word used about God?","options":["Creator","Computer","Weather"],"correct":0,"explanation":"Creator is a common word to describe God."},{"type":"tf","q":"God is always distant and not involved with people.","correct":false,"explanation":"False — many Christians believe God is present and cares for people."},{"type":"mc","q":"If you have questions about God, you should: ","options":["Ignore them","Explore them honestly","Pretend they don’t exist"],"correct":1,"explanation":"Exploring questions honestly is helpful."},{"type":"tf","q":"Different Christian groups might emphasize different things about God.","correct":true,"explanation":"True — traditions can stress different aspects of God."}]},

  {"id":3,"title":"Who Is Jesus? (Overview)","purpose":"A simple explanation of Jesus and why Christians focus on him.","study":["Jesus is the main person in Christianity. Christians believe he taught about God and showed God's love.","Christians believe Jesus lived, died, and was raised again. They see this as a source of hope and forgiveness.","Even if you have doubts, learning about Jesus helps explain Christian beliefs.","We will explain what people mean by Jesus in everyday terms, not complex theology.","Take the ideas slowly and ask questions as you go.","The goal is clear understanding, not pressure to decide."],"verses":[{"ref":"John 11:25 NLT","text":"I am the resurrection and the life. Anyone who believes in me will live, even after dying."}],"quiz":[{"type":"mc","q":"Who is central to Christianity?","options":["Jesus","Moses","Plato"],"correct":0,"explanation":"Jesus is central to Christianity."},{"type":"tf","q":"Christians believe Jesus showed God’s love.","correct":true,"explanation":"True — many Christians see Jesus as showing Jesus as showing God's love in actions and teaching."},{"type":"tf","q":"Understanding Jesus is only for experts.","correct":false,"explanation":"False — this course explains Jesus simply for anyone."},{"type":"mc","q":"Which is often connected to Jesus’ life?","options":["Teaching and helping","Only politics","Sports"],"correct":0,"explanation":"Jesus is often connected with teaching and helping others."},{"type":"tf","q":"You must accept all church ideas to study Jesus.","correct":false,"explanation":"False — you can learn and form your own view without pressure."}]},

  {"id":4,"title":"What Is the Bible? (How to Read It)","purpose":"Give simple tools for reading the Bible as a beginner.","study":["The Bible is a collection of many books: stories, letters, and songs.","Read a short passage slowly and ask what it says and what it might mean for you.","Use a simple translation and a few short notes to help with hard words."],"verses":[{"ref":"2 Timothy 3:16 NLT","text":"All Scripture is inspired by God and is useful for teaching and training in right living."}],"quiz":[{"type":"mc","q":"The Bible is: ","options":["A library of different kinds of writing","A single type of writing","A cookbook"],"correct":0,"explanation":"It includes stories, poems, letters, and more."},{"type":"tf","q":"Reading a short passage slowly can help you understand it.","correct":true,"explanation":"True — slow, careful reading helps."},{"type":"mc","q":"A helpful question to ask when reading: ","options":["What did it mean then?","What did it taste like?","What is its font?"],"correct":0,"explanation":"Asking the historical and personal meaning helps understanding."},{"type":"tf","q":"You need to memorize the whole Bible to begin studying it.","correct":false,"explanation":"False — start small and grow your reading over time."},{"type":"tf","q":"Different parts of the Bible can be different kinds of writing.","correct":true,"explanation":"True — stories, poetry, letters, and more."}]},
    {"id":5,"title":"What Christians Mean by “Sin"","purpose":"Explain sin simply: what it is and why it matters.","study":["In simple words, sin means choosing things that hurt others or break the way life should work.","It can be big choices or small repeated habits that harm relationships, trust, or self.","Christians believe recognizing harmful choices is the first step toward change and healing.","Many faith practices focus on honesty, repair, and trying to do better — not just guilt.","Understanding sin is not about making you feel small, but about naming what needs repair.","This course will explain forgiveness and practical steps after recognizing what’s wrong."],"verses":[{"ref":"Romans 3:23 NLT","text":"For everyone has sinned; we all fall short of God’s glorious standard."}],"quiz":[{"type":"tf","q":"Sin only means big crimes.","correct":false,"explanation":"False — it can be small repeated hurts as well as big wrongs."},{"type":"mc","q":"Recognizing harmful choices is: ","options":["A step toward healing","Always a sign of weakness","Never helpful"],"correct":0,"explanation":"Naming what’s wrong can lead to repair."},{"type":"tf","q":"Christian practice often includes trying to repair harm.","correct":true,"explanation":"True — forgiveness and repair are common themes."},{"type":"mc","q":"Sin affects:","options":["Relationships","Only laws","Only nature"],"correct":0,"explanation":"It often affects relationships and trust."},{"type":"tf","q":"The course shames you for doubts.","correct":false,"explanation":"False — the tone is honest and non-judgmental."}]},    {"id":6,"title":"Grace and Forgiveness","purpose":"Explain grace simply and how forgiveness works in Christian thought.","study":["Grace is often described as getting help or kindness you don’t fully deserve; it’s a main idea in Christianity.","Forgiveness means letting go of blame and working toward repair when someone hurts another.","Christians see God’s grace as a way to start again rather than being trapped by past mistakes.","Practically, forgiveness may mean saying sorry, changing behavior, and rebuilding trust over time.","Grace does not always remove consequences, but it offers a hopeful path forward.","We’ll look at real examples and small steps for giving and receiving forgiveness."],"verses":[{"ref":"Ephesians 2:8 NLT","text":"God saved you by his grace when you believed. And you can’t take credit for this; it is a gift from God."}],"quiz":[{"type":"tf","q":"Grace means getting kindness you don’t deserve.","correct":true,"explanation":"True — grace is often described this way."},{"type":"mc","q":"Forgiveness often includes:","options":["Trying to repair relationships","Instantly forgetting everything","Making everything pretend to be okay"],"correct":0,"explanation":"Repair and trust-building are practical parts of forgiveness."},{"type":"tf","q":"Grace removes all consequences automatically.","correct":false,"explanation":"False — there may still be consequences, but grace opens a path forward."},{"type":"mc","q":"Which is a helpful step in forgiving?","options":["Saying sorry","Ignoring someone","Blaming others"],"correct":0,"explanation":"Apology and changed behavior help healing."},{"type":"tf","q":"Grace is a hopeful idea in Christianity.","correct":true,"explanation":"True — grace points to hope and new starts."}]} ] 