[{"id":1,"title":"What This Course Is About","purpose":"Understand the course goal: short lessons with a quiz to help learning.","study":["Welcome! This is a short guide to Christianity for beginners.","We do not try to make you join anything.","We help you understand so you can decide.","Each unit has short study, verses, and a quiz.","We use plain, everyday language.","Quizzes help you think and learn. Questions are normal."],"verses":[{"ref":"John 3:16 NLT","text":"For God loved the world so much that he gave his one and only Son, so that everyone who believes in him will not be lost but have eternal life."},{"ref":"Matthew 7:7 NLT","text":"Ask, and you will receive. Seek, and you will find. Knock, and the door will be opened to you."}],"quiz":[{"type":"tf","q":"This course wants to force you to join a church.","correct":false,"explanation":"False. The course aims to explain Christianity so you can decide for yourself."},{"type":"mc","q":"How long should a unit take?","options":["5-10 minutes","1-2 hours","A full day"],"correct":0,"explanation":"Units are short and focused so you can learn a bit at a time."},{"type":"tf","q":"The quizzes are meant to shame you.","correct":false,"explanation":"False. Quizzes help you remember and learn."},{"type":"mc","q":"What will each unit include?","options":["Short study, 1-2 verses, and a short quiz","Long essays only for experts","Only videos and no text"],"correct":0,"explanation":"That is the simple, consistent format."},{"type":"mc","q":"If you do not understand a term, what should you expect?","options":["The course will explain it simply","You will be left to look it up","The course will avoid every important term"],"correct":0,"explanation":"The tone is friendly and clarifies church words when needed."}]},{"id":2,"title":"Who Is God? (Overview)","purpose":"A plain summary of God from a Christian view.","study":["Christians say God made and keeps everything.","Many say God is loving, fair, and near.","God is not distant. God cares about people.","Different churches say different things about God.","Questions about God are normal.","We use clear examples so you form your own view."],"verses":[{"ref":"Psalm 100:5 NLT","text":"The Lord is good. His love lasts forever, and he is faithful to all who trust him."}],"quiz":[{"type":"tf","q":"Christians describe God as a caring creator.","correct":true,"explanation":"True — Christians often speak of God as loving and creating the world."},{"type":"mc","q":"Which is a common word used about God?","options":["Creator","Computer","Weather"],"correct":0,"explanation":"Creator is a common word to describe God."},{"type":"tf","q":"God is always distant and not involved with people.","correct":false,"explanation":"False — many Christians believe God is present and cares for people."},{"type":"mc","q":"If you have questions about God, you should:","options":["Ignore them","Explore them honestly","Pretend they do not exist"],"correct":1,"explanation":"Exploring questions honestly is helpful."},{"type":"tf","q":"Different Christian groups might emphasize different things about God.","correct":true,"explanation":"True — traditions can stress different aspects of God."}]},{"id":3,"title":"Who Is Jesus? (Overview)","purpose":"A simple explanation of Jesus and why Christians focus on him.","study":["Jesus is the main figure in Christianity.","Christians say Jesus taught about God and showed God's love.","Christians say Jesus died and came back to life. This gives hope.","Learning about Jesus helps explain what Christians believe.","We explain Jesus in simple, everyday words.","Questions are welcome. You do not have to decide anything."],"verses":[{"ref":"John 11:25 NLT","text":"I am the resurrection and the life. Anyone who believes in me will live, even after dying."}],"quiz":[{"type":"mc","q":"Who is central to Christianity?","options":["Jesus","Moses","Plato"],"correct":0,"explanation":"Jesus is central to Christianity."},{"type":"tf","q":"Christians believe Jesus showed God's love.","correct":true,"explanation":"True — many Christians see Jesus as showing God's love in actions and teaching."},{"type":"tf","q":"Understanding Jesus is only for experts.","correct":false,"explanation":"False — this course explains Jesus simply for anyone."},{"type":"mc","q":"Which is often connected to Jesus' life?","options":["Teaching and helping","Only politics","Sports"],"correct":0,"explanation":"Jesus is often connected with teaching and helping others."},{"type":"tf","q":"You must accept all church ideas to study Jesus.","correct":false,"explanation":"False — you can learn and form your own view without pressure."}]},{"id":4,"title":"What Is the Bible? (How to Read It)","purpose":"Give simple tools for reading the Bible as a beginner.","study":["The Bible is a collection of many books: stories, letters, and songs.","Read a short passage slowly and ask what it says and what it might mean for you.","Use a simple translation and a few short notes to help with hard words."],"verses":[{"ref":"2 Timothy 3:16 NLT","text":"All Scripture is inspired by God and is useful for teaching and training in right living."}],"quiz":[{"type":"mc","q":"The Bible is:","options":["A library of different kinds of writing","A single type of writing","A cookbook"],"correct":0,"explanation":"It includes stories, poems, letters, and more."},{"type":"tf","q":"Reading a short passage slowly can help you understand it.","correct":true,"explanation":"True — slow, careful reading helps."},{"type":"mc","q":"A helpful question to ask when reading:","options":["What did it mean then?","What did it taste like?","What is its font?"],"correct":0,"explanation":"Asking the historical and personal meaning helps understanding."},{"type":"tf","q":"You need to memorize the whole Bible to begin studying it.","correct":false,"explanation":"False — start small and grow your reading over time."},{"type":"tf","q":"Different parts of the Bible can be different kinds of writing.","correct":true,"explanation":"True — stories, poetry, letters, and more."}]},{"id":5,"title":"What Christians Mean by Sin","purpose":"Explain sin simply: what it is and why it matters.","study":["Sin means choosing to do things that hurt others or break how life should work.","It can be big choices or small habits that harm trust or relationships.","Recognizing harm is the first step to change and healing.","Many faith practices focus on honesty, repair, and doing better.","The point is not shame, but naming what needs to be fixed.","We will cover forgiveness and steps to make things right."],"verses":[{"ref":"Romans 3:23 NLT","text":"For everyone has sinned; we all fall short of God's glorious standard."}],"quiz":[{"type":"tf","q":"Sin only means big crimes.","correct":false,"explanation":"False — it can be small repeated hurts as well as big wrongs."},{"type":"mc","q":"Recognizing harmful choices is:","options":["A step toward healing","Always a sign of weakness","Never helpful"],"correct":0,"explanation":"Naming what is wrong can lead to repair."},{"type":"tf","q":"Christian practice often includes trying to repair harm.","correct":true,"explanation":"True — forgiveness and repair are common themes."},{"type":"mc","q":"Sin affects:","options":["Relationships","Only laws","Only nature"],"correct":0,"explanation":"It often affects relationships and trust."},{"type":"tf","q":"The course shames you for doubts.","correct":false,"explanation":"False — the tone is honest and non-judgmental."}]},{"id":6,"title":"Grace and Forgiveness","purpose":"Explain grace simply and how forgiveness works in Christian thought.","study":["Grace means getting help or kindness you do not earn. It is core to Christianity.","Forgiveness means letting go of anger and working to repair harm.","Christians see God's grace as a fresh start, not being stuck in past mistakes.","Forgiveness can mean: say sorry, change, and build trust again.","Grace may not remove all consequences. But it offers hope.","Look at real examples of giving and getting forgiveness."],"verses":[{"ref":"Ephesians 2:8 NLT","text":"God saved you by his grace when you believed. And you cannot take credit for this; it is a gift from God."}],"quiz":[{"type":"tf","q":"Grace means getting kindness you do not deserve.","correct":true,"explanation":"True — grace is often described this way."},{"type":"mc","q":"Forgiveness often includes:","options":["Trying to repair relationships","Instantly forgetting everything","Making everything pretend to be okay"],"correct":0,"explanation":"Repair and trust-building are practical parts of forgiveness."},{"type":"tf","q":"Grace removes all consequences automatically.","correct":false,"explanation":"False — there may still be consequences, but grace opens a path forward."},{"type":"mc","q":"Which is a helpful step in forgiving?","options":["Saying sorry","Ignoring someone","Blaming others"],"correct":0,"explanation":"Apology and changed behavior help healing."},{"type":"tf","q":"Grace is a hopeful idea in Christianity.","correct":true,"explanation":"True — grace points to hope and new starts."}]},{"id":7,"title":"Jesus' Birth and Early Life","purpose":"Understand the story of Jesus' birth and what it means to Christians.","study":["Christians say Jesus was born to Mary, a young woman in Bethlehem.","The birth is seen as a special moment when God became human.","His early life shows him growing and learning like other people.","Different traditions have different views about how to understand the birth.","The focus is on God's love shown in becoming human.","This story shapes much of Christian celebration and belief."],"verses":[{"ref":"Luke 2:11 NLT","text":"The Savior—yes, the Messiah, the Lord—has been born today in Bethlehem, the city of David!"},{"ref":"Matthew 1:23 NLT","text":"'The virgin will conceive a child! She will give birth to a son, and they will call him Immanuel, which means God is with us.'"}],"quiz":[{"type":"mc","q":"Where was Jesus born according to Christian tradition?","options":["Bethlehem","Jerusalem","Rome"],"correct":0,"explanation":"Bethlehem is the traditional birthplace of Jesus."},{"type":"tf","q":"Christians see Jesus' birth as a moment God became human.","correct":true,"explanation":"True — the incarnation is central to Christian belief."},{"type":"tf","q":"Jesus grew up instantly as an adult.","correct":false,"explanation":"False — Jesus experienced childhood and growth like others."},{"type":"mc","q":"Immanuel means:","options":["God is with us","God is far away","God is sleeping"],"correct":0,"explanation":"Immanuel expresses God's presence with people."},{"type":"tf","q":"All churches understand Jesus' birth exactly the same way.","correct":false,"explanation":"False — different traditions emphasize different aspects."}]},{"id":8,"title":"Jesus' Ministry and Teachings","purpose":"Learn what Jesus taught and how he spent his adult life.","study":["Jesus spent his adult life teaching and helping people.","He told stories called parables that showed God's love and justice.","He healed sick people and spent time with outcasts and poor.","He taught that loving God and loving your neighbor are central.","His words challenged unfairness and religious pretense.","His life showed that God cares for the whole person, not just rules."],"verses":[{"ref":"Matthew 22:37-39 NLT","text":"Jesus replied, 'You must love the Lord your God with all your heart, all your soul, and all your mind. This is the first and greatest commandment. A second is equally important: Love your neighbor as yourself.'"},{"ref":"Matthew 5:3 NLT","text":"God blesses those who are poor and realize their need for him, for the Kingdom of Heaven is theirs."}],"quiz":[{"type":"mc","q":"What did Jesus teach about love?","options":["Love God and love your neighbor","Love money and power","Love yourself only"],"correct":0,"explanation":"Love of God and neighbor are central to Jesus' teaching."},{"type":"tf","q":"Jesus only spent time with wealthy people.","correct":false,"explanation":"False — Jesus spent time with poor and outcast people."},{"type":"mc","q":"Jesus taught using:","options":["Stories called parables","Only scientific lectures","Angry speeches"],"correct":0,"explanation":"Parables were a main way Jesus taught."},{"type":"tf","q":"Jesus focused only on religious rules.","correct":false,"explanation":"False — he challenged rigid rules and showed God's compassion."},{"type":"tf","q":"Jesus healed people as part of his ministry.","correct":true,"explanation":"True — healing was an important part of his life and message."}]},{"id":9,"title":"Jesus' Death and Why It Matters","purpose":"Explain the crucifixion and what Christians see as its meaning.","study":["Christians say Jesus was arrested, tried, and put to death by crucifixion.","This was a painful death used by Rome for criminals.","Christians understand Jesus' death in different ways.","Many say his death offers forgiveness and healing for people.","The death is seen as an act of love, not just tragedy.","The meaning includes sacrifice, payment, victory, or example."],"verses":[{"ref":"John 3:16 NLT","text":"For God loved the world so much that he gave his one and only Son, so that everyone who believes in him will not be lost but have eternal life."},{"ref":"Romans 5:8 NLT","text":"But God showed his great love for us by sending Christ to die for us while we were still sinners."}],"quiz":[{"type":"tf","q":"Jesus died by crucifixion according to Christian accounts.","correct":true,"explanation":"True — this is historical and theological center to Christianity."},{"type":"mc","q":"Christians understand Jesus' death as:","options":["An act of love and sacrifice","Just a tragedy with no meaning","Accidental"],"correct":0,"explanation":"Christians see deep meaning in Jesus' death."},{"type":"tf","q":"All Christians understand the death the exact same way.","correct":false,"explanation":"False — different traditions offer different interpretations."},{"type":"mc","q":"Jesus' death showed:","options":["God's love for people","God's anger at people","God's indifference"],"correct":0,"explanation":"Christians see it as showing God's love."},{"type":"tf","q":"The crucifixion is only a historical fact with no spiritual meaning.","correct":false,"explanation":"False — Christians find deep spiritual meaning in it."}]},{"id":10,"title":"Resurrection and New Life","purpose":"Understand what Christians mean by resurrection and Easter.","study":["Christians say Jesus rose from the dead after three days.","This is the core of Christian hope and joy.","Resurrection means new life, not just going back to the old life.","Christians believe resurrection points to God's power over death.","This gives hope to believers that death is not the end.","The resurrection celebrates God's love conquering suffering."],"verses":[{"ref":"1 Corinthians 15:57 NLT","text":"But thank God! He gives us victory over sin and death through our Lord Jesus Christ."},{"ref":"Romans 6:9 NLT","text":"We know that Christ, being raised from the dead, dies no more. Death no longer has dominion over him."}],"quiz":[{"type":"tf","q":"Christians believe Jesus rose from the dead.","correct":true,"explanation":"True — resurrection is central to Christian faith."},{"type":"mc","q":"Resurrection means:","options":["New life, not just returning to old life","Going back to exactly how things were","Disappearing forever"],"correct":0,"explanation":"Resurrection points to transformation and newness."},{"type":"tf","q":"Resurrection shows God's power over death.","correct":true,"explanation":"True — this is a main theme in Christian theology."},{"type":"mc","q":"Easter celebrates:","options":["Jesus' resurrection","Spring flowers only","Chocolate bunnies"],"correct":0,"explanation":"Easter is the Christian celebration of resurrection."},{"type":"tf","q":"Resurrection gives Christians hope about death.","correct":true,"explanation":"True — it transforms how Christians view death and the future."}]},{"id":11,"title":"What Is Faith?","purpose":"Explain faith in simple terms and how it works in Christianity.","study":["Faith means trusting in God and in Jesus.","It is not about blind belief but trusting what you can see reflected in people's lives.","Faith includes doubt. Questions show you are thinking.","Faith grows through reading, prayer, and time with others.","Faith is a choice but also a gift. You decide to trust, but the ability comes from God.","Faith changes how you live and what you value."],"verses":[{"ref":"Hebrews 11:1 NLT","text":"Faith is the confidence that what we hope for will actually happen; it gives us assurance about things we cannot see."},{"ref":"Romans 10:17 NLT","text":"So faith comes from hearing, that is, hearing the Good News about Christ."}],"quiz":[{"type":"tf","q":"Faith means never having doubts.","correct":false,"explanation":"False — faith and doubt can exist together."},{"type":"mc","q":"Faith in Christianity means trusting in:","options":["God and Jesus","Only what you can see","Money and power"],"correct":0,"explanation":"Christian faith is trust in God and Jesus."},{"type":"tf","q":"Questions show weak faith.","correct":false,"explanation":"False — questions show you are thinking and exploring."},{"type":"mc","q":"How does faith grow?","options":["Through reading, prayer, and community","By avoiding all questions","By pretending you understand everything"],"correct":0,"explanation":"Faith develops through engagement with scripture and community."},{"type":"tf","q":"Faith is only a personal thing with no community aspect.","correct":false,"explanation":"False — Christian faith is often nurtured in community."}]},{"id":12,"title":"Salvation: What Does It Mean?","purpose":"Explain what Christians mean by salvation and being saved.","study":["Salvation means being rescued from sin and its harm.","Christians say Jesus offers salvation through his death and resurrection.","Being saved means trusting in Jesus and changing your life.","It is not about being perfect. It is about choosing to follow Jesus.","Salvation brings forgiveness, peace, and hope for the future.","Different churches emphasize different aspects of salvation."],"verses":[{"ref":"John 10:9 NLT","text":"Yes, I am the gate. Those who come in through me will be saved. They will come and go freely and will find good pastures."},{"ref":"Acts 16:31 NLT","text":"They replied, 'Believe in the Lord Jesus and you will be saved, along with everyone in your household.'"}],"quiz":[{"type":"mc","q":"Salvation in Christianity means:","options":["Being rescued from sin and its harm","Becoming rich","Never having problems"],"correct":0,"explanation":"Salvation addresses sin and spiritual harm."},{"type":"tf","q":"Jesus offers salvation through his death and resurrection.","correct":true,"explanation":"True — this is central to Christian understanding of salvation."},{"type":"tf","q":"Salvation requires being perfect.","correct":false,"explanation":"False — it is about trusting Jesus, not perfection."},{"type":"mc","q":"Being saved includes:","options":["Forgiveness and changed life","Only forgiveness with no change","Staying exactly the same"],"correct":0,"explanation":"Salvation includes both forgiveness and transformation."},{"type":"tf","q":"All churches define salvation exactly the same way.","correct":false,"explanation":"False — different traditions emphasize different elements."}]},{"id":13,"title":"The Holy Spirit","purpose":"Understand what Christians mean by the Holy Spirit and its role.","study":["The Holy Spirit is God's presence and power in people's lives.","It is not a ghost or invisible person, but God active in the world.","The Spirit guides, comforts, and empowers believers.","Christians say the Spirit helps us understand Scripture and know God.","The Spirit works in hearts to create change and growth.","Different churches have different practices around the Spirit."],"verses":[{"ref":"John 14:26 NLT","text":"But when the Father sends the Advocate as my representative—that is, the Holy Spirit—he will teach you everything and will remind you of everything I have told you."},{"ref":"Romans 8:26 NLT","text":"And the Holy Spirit helps us in our weakness. For example, we don't know what God wants us to pray for. But the Holy Spirit prays for us with groanings that cannot be expressed in words."}],"quiz":[{"type":"mc","q":"The Holy Spirit is:","options":["God's presence and power working in people","A ghost or invisible person","Only in churches"],"correct":0,"explanation":"The Spirit is God's active presence in the world."},{"type":"tf","q":"The Holy Spirit helps Christians understand Scripture.","correct":true,"explanation":"True — guidance in understanding is a main role of the Spirit."},{"type":"mc","q":"The Spirit works to:","options":["Guide, comfort, and empower believers","Punish people","Only help in churches"],"correct":0,"explanation":"The Spirit's work includes guidance, comfort, and empowerment."},{"type":"tf","q":"All churches practice understanding the Spirit the same way.","correct":false,"explanation":"False — different traditions have different practices."},{"type":"tf","q":"The Spirit only helped people in Bible times.","correct":false,"explanation":"False — Christians believe the Spirit works today as well."}]},{"id":14,"title":"Prayer: Talking with God","purpose":"Explain prayer and how Christians approach it.","study":["Prayer is talking with God honestly about what matters to you.","It is not fancy words or showing off. Simple, honest prayer is best.","Prayer includes asking, thanking, listening, and saying sorry.","God listens but does not always answer exactly as asked.","Prayer changes us more than it changes circumstances.","Prayer is for everyone, not just priests or experts."],"verses":[{"ref":"1 Thessalonians 5:17 NLT","text":"Never stop praying."},{"ref":"Matthew 6:6 NLT","text":"But when you pray, go into your room, shut the door, and pray to your Father who is in secret; and your Father who sees in secret will reward you."}],"quiz":[{"type":"mc","q":"Prayer is:","options":["Honest talking with God","Fancy words to impress others","Something only priests can do"],"correct":0,"explanation":"Prayer is simple, honest communication with God."},{"type":"tf","q":"Prayer includes asking, thanking, listening, and apologizing.","correct":true,"explanation":"True — prayer involves many kinds of communication."},{"type":"mc","q":"God always answers prayer exactly as asked.","correct":false,"explanation":"False — but God does listen and respond in God's wisdom."},{"type":"tf","q":"Prayer changes us more than it changes circumstances.","correct":true,"explanation":"True — prayer often transforms the pray-er."},{"type":"tf","q":"Only special people can pray.","correct":false,"explanation":"False — prayer is for everyone, not just experts."}]},{"id":15,"title":"The Church and Community","purpose":"Understand what the church is and why community matters.","study":["The church is the community of believers, not just a building.","People gather to worship, learn, support each other, and serve.","Church provides friendship, prayer, and help during hard times.","Different churches have different styles and beliefs.","You can explore different churches to find one that fits.","Being part of a community helps faith grow and become real."],"verses":[{"ref":"1 Thessalonians 5:11 NLT","text":"So encourage each other and build each other up, just as you are already doing."},{"ref":"Hebrews 10:24-25 NLT","text":"Let us think of ways to motivate one another to acts of love and good works. And let us not neglect our meeting together, as some people do, but encourage one another, especially now that the day of his return is drawing near."}],"quiz":[{"type":"mc","q":"The church is:","options":["The community of believers","Only a building","Only for perfect people"],"correct":0,"explanation":"The church is fundamentally a community of people."},{"type":"tf","q":"Church provides friendship and support.","correct":true,"explanation":"True — community support is an important function."},{"type":"mc","q":"Different churches:","options":["Have different styles and beliefs","Are all exactly identical","Only exist online"],"correct":0,"explanation":"Diversity in Christian traditions is real."},{"type":"tf","q":"You must join a church to be Christian.","correct":false,"explanation":"False — faith is personal, though community is helpful."},{"type":"tf","q":"Being part of a church community helps faith grow.","correct":true,"explanation":"True — community supports spiritual growth."}]},{"id":16,"title":"Baptism: What It Means","purpose":"Explain baptism and its significance in Christian life.","study":["Baptism is a symbolic act using water to show trust in Jesus.","It represents being washed clean and starting new with God.","Different churches baptize at different times: infants, children, or adults.","Some traditions sprinkle water. Others fully immerse.","Baptism is an outward sign of an inward faith.","It is important in Christian tradition but not required for salvation."],"verses":[{"ref":"Romans 6:3-4 NLT","text":"Don't you realize that all of us who were baptized into Christ Jesus were baptized into his death? We were therefore buried with him through baptism into death in order that, just as Christ was raised from the dead through the glory of the Father, we too may live a new life."},{"ref":"Acts 2:38 NLT","text":"Peter replied, 'Each of you must repent of your sins and turn to Christ, and be baptized in the name of Jesus Christ for the forgiveness of your sins.'"}],"quiz":[{"type":"mc","q":"Baptism is:","options":["A symbolic act using water showing trust in Jesus","Required for salvation","A punishment for sins"],"correct":0,"explanation":"Baptism is a symbol of faith and new life."},{"type":"tf","q":"Baptism represents being cleaned and starting new.","correct":true,"explanation":"True — water symbolizes cleansing and new beginning."},{"type":"mc","q":"Different churches baptize:","options":["At different times using different methods","All exactly the same way","Never"],"correct":0,"explanation":"Christian traditions have different baptism practices."},{"type":"tf","q":"Baptism is required for God to forgive you.","correct":false,"explanation":"False — forgiveness comes through faith in Jesus."},{"type":"tf","q":"Baptism is important in Christian tradition.","correct":true,"explanation":"True — it marks commitment and faith."}]},{"id":17,"title":"Communion: The Shared Meal","purpose":"Explain communion and what it means to Christians.","study":["Communion is a meal sharing bread and wine or grape juice.","It remembers Jesus' death and celebrates his presence.","Jesus told his followers to share this meal in his memory.","Different churches understand communion in different ways.","Some see it as mainly remembering. Others see deeper spiritual meaning.","Sharing communion is a central practice in most churches."],"verses":[{"ref":"1 Corinthians 11:24-25 NLT","text":"For I received from the Lord what I also passed on to you: The Lord Jesus, on the night he was betrayed, took bread, and when he had given thanks, he broke it and said, 'This is my body, which is for you; do this in remembrance of me.' In the same way, after supper he took the cup, saying, 'This cup is the new covenant in my blood; do this, whenever you drink it, in remembrance of me.'"},{"ref":"John 6:51 NLT","text":"I am the living bread that came down from heaven. Whoever eats this bread will live forever. This bread is my flesh, which I will give for the life of the world."}],"quiz":[{"type":"mc","q":"Communion is:","options":["A meal with bread and wine remembering Jesus","A punishment","Only for clergy"],"correct":0,"explanation":"Communion is a shared meal in Christian tradition."},{"type":"tf","q":"Jesus asked his followers to share communion in his memory.","correct":true,"explanation":"True — this is the origin of the practice."},{"type":"mc","q":"Different churches understand communion:","options":["In different ways","All exactly the same","As unimportant"],"correct":0,"explanation":"There are different Christian understandings of communion."},{"type":"tf","q":"Communion is central to most Christian practice.","correct":true,"explanation":"True — it is a major practice in most traditions."},{"type":"tf","q":"Only perfect people can participate in communion.","correct":false,"explanation":"False — communion welcomes all believers."}]},{"id":18,"title":"The Bible's Story: Creation to Jesus","purpose":"Understand the main story arc of the Bible.","study":["The Bible tells a long story from creation to Jesus and beyond.","It shows God creating the world, people choosing wrongly, and God offering restoration.","God works through history with prophets, kings, and ordinary people.","The story shows human struggle and God's faithfulness.","Jesus is presented as the fulfillment of what God was doing.","Understanding the big story helps individual passages make sense."],"verses":[{"ref":"Genesis 1:1 NLT","text":"In the beginning God created the heavens and the earth."},{"ref":"Revelation 21:3 NLT","text":"I heard a loud shout from the throne, saying, 'Look, God's home is now among his people! He will dwell with them, and they will be his people. God himself will be with them.'"}],"quiz":[{"type":"mc","q":"The Bible's main story includes:","options":["Creation to Jesus and beyond","Only Jesus","Only laws"],"correct":0,"explanation":"The Bible spans from creation to Jesus to the future."},{"type":"tf","q":"The Bible shows only perfect people.","correct":false,"explanation":"False — it shows real people with struggles."},{"type":"mc","q":"Jesus is presented as:","options":["The fulfillment of God's work","Unrelated to the rest of the Bible","A later addition"],"correct":0,"explanation":"Jesus is central to Christian understanding of Scripture."},{"type":"tf","q":"Understanding the big story helps with individual passages.","correct":true,"explanation":"True — context helps understanding."},{"type":"tf","q":"God's faithfulness is a theme throughout the Bible.","correct":true,"explanation":"True — God's steadiness is a major theme."}]},{"id":19,"title":"Love of Neighbor and Justice","purpose":"Explore what Jesus taught about helping others and justice.","study":["Jesus taught that loving your neighbor is as important as loving God.","This includes caring for poor, sick, and marginalized people.","Justice means working toward fairness and right relationships.","Christians are called to act on these beliefs, not just feel them.","This includes both personal kindness and working for bigger changes.","Many Christian movements have started to fight injustice."],"verses":[{"ref":"Matthew 25:35-40 NLT","text":"For I was hungry, and you fed me. I was thirsty, and you gave me a drink. I was a stranger, and you invited me into your home. I was naked, and you gave me clothing. I was sick, and you cared for me. I was in prison, and you visited me. Then these righteous ones will reply, 'Lord, when did we ever see you hungry and feed you? Or thirsty and give you something to drink? Or a stranger and show you hospitality? Or naked and give you clothing? Or sick or in prison and visit you?' And the King will say, 'I tell you the truth, when you did it to the least of these my brothers and sisters, you were doing it to me!'"},{"ref":"Amos 5:24 NLT","text":"Instead, let justice roll down like waters and righteousness like an ever-flowing stream!"}],"quiz":[{"type":"tf","q":"Jesus taught that loving neighbor is as important as loving God.","correct":true,"explanation":"True — he made this central to his message."},{"type":"mc","q":"Who did Jesus especially mention helping?","options":["The poor, sick, and marginalized","Rich and powerful people only","People who already have resources"],"correct":0,"explanation":"Jesus emphasized care for vulnerable people."},{"type":"tf","q":"Justice means only personal kindness.","correct":false,"explanation":"False — it also includes working for bigger changes."},{"type":"mc","q":"Christian teaching on justice is:","options":["To actively work for fairness","To ignore problems","To only think about it"],"correct":0,"explanation":"Christians are called to act on their beliefs."},{"type":"tf","q":"Christian movements have worked for justice.","correct":true,"explanation":"True — many social justice movements had Christian roots."}]},{"id":20,"title":"Loving Your Enemies","purpose":"Understand Jesus' surprising teaching about enemies and conflict.","study":["Jesus taught something radical: love your enemies.","This does not mean letting them harm you. It means refusing hatred.","It includes praying for those who hurt you.","This shows God's way is different from revenge.","Love of enemies is one of the hardest Christian teachings.","It requires strength and trust in God, not weakness."],"verses":[{"ref":"Matthew 5:44 NLT","text":"But I say, love your enemies! Pray for those who persecute you!"},{"ref":"Romans 12:19-21 NLT","text":"Dear friends, never take revenge. Leave that to the righteous anger of God. For the Scriptures say, 'I will take revenge; I will pay them back,' says the Lord. Instead, do what the Scriptures say: 'If your enemies are hungry, feed them. If they are thirsty, give them something to drink. In doing this, you will heap burning coals of shame on their heads.' Don't let evil conquer you, but conquer evil by doing good."}],"quiz":[{"type":"tf","q":"Jesus taught to love your enemies.","correct":true,"explanation":"True — this is one of his teachings."},{"type":"mc","q":"Loving enemies means:","options":["Refusing hatred and praying for them","Letting them harm you","Being weak"],"correct":0,"explanation":"Love of enemies is actually a form of strength."},{"type":"tf","q":"This teaching shows God's way is different from revenge.","correct":true,"explanation":"True — it transforms how we respond to harm."},{"type":"mc","q":"Loving enemies requires:","options":["Strength and trust in God","Nothing from us","Doing it alone"],"correct":0,"explanation":"It requires real spiritual strength."},{"type":"tf","q":"All Christians find this teaching easy.","correct":false,"explanation":"False — it is one of the hardest teachings."}]},{"id":21,"title":"Money and Wealth","purpose":"Explore what Jesus and the Bible teach about money.","study":["Jesus talked often about money and how we use it.","He warned against putting too much hope in wealth.","He taught generosity and sharing with those in need.","Money is not evil, but loving money becomes a problem.","Christians are called to use money wisely and generously.","Giving and sharing are ways to show faith and love."],"verses":[{"ref":"Matthew 6:24 NLT","text":"No one can serve two masters. For you will hate one and love the other; you will be devoted to one and despise the other. You cannot serve both God and money."},{"ref":"1 Timothy 6:10 NLT","text":"For the love of money is the root of all kinds of evil. And some people, craving money, have wandered from the true faith and pierced themselves with many sorrows."},{"ref":"Proverbs 11:24 NLT","text":"Give freely and become more wealthy; be stingy and lose everything."}],"quiz":[{"type":"tf","q":"Jesus said money is the root of all evil.","correct":false,"explanation":"False — he said the LOVE of money is the problem."},{"type":"mc","q":"Jesus taught about money to show:","options":["How it can become a trap","That it is always evil","That we should desire it"],"correct":0,"explanation":"Jesus was concerned about money becoming an idol."},{"type":"tf","q":"Generosity is a Christian value.","correct":true,"explanation":"True — sharing is encouraged in Christian teaching."},{"type":"mc","q":"Christians are called to:","options":["Use money wisely and generously","Hoard as much as possible","Ignore money completely"],"correct":0,"explanation":"Wise and generous use of money is the teaching."},{"type":"tf","q":"Giving is a way to show faith and love.","correct":true,"explanation":"True — generosity demonstrates values."}]},{"id":22,"title":"Suffering and Pain","purpose":"Address how Christians understand suffering and God's role.","study":["The Bible does not pretend suffering is not real or bad.","Christians struggle with why God allows suffering.","Different traditions offer different answers.","Some say suffering builds character. Others focus on God's presence during pain.","Jesus himself suffered, showing God understands pain.","Faith does not eliminate suffering, but gives meaning and hope."],"verses":[{"ref":"Romans 8:28 NLT","text":"And we know that God causes everything to work together for the good of those who love God and are called according to his purpose for them."},{"ref":"2 Corinthians 1:3-4 NLT","text":"All praise to God, the Father of our Lord Jesus Christ. God is our merciful Father and the source of all comfort. He comforts us in all our troubles so that we can comfort those who are in any trouble with the comfort we ourselves receive from God."}],"quiz":[{"type":"tf","q":"The Bible says suffering is not real.","correct":false,"explanation":"False — it acknowledges suffering is real and difficult."},{"type":"mc","q":"Jesus' suffering shows:","options":["God understands pain","God causes suffering","Pain is punishment"],"correct":0,"explanation":"Jesus' suffering demonstrates God's understanding."},{"type":"tf","q":"All Christians answer why suffering exists the same way.","correct":false,"explanation":"False — different traditions have different perspectives."},{"type":"mc","q":"Faith during suffering:","options":["Gives meaning and hope","Eliminates all pain immediately","Makes suffering disappear"],"correct":0,"explanation":"Faith provides hope and meaning, not magical removal."},{"type":"tf","q":"God can comfort us during suffering.","correct":true,"explanation":"True — comfort during pain is a Christian belief."}]},{"id":23,"title":"Death and the Afterlife","purpose":"Understand Christian beliefs about death and what comes after.","study":["Christians believe death is not the end because of Jesus' resurrection.","Different traditions have different ideas about heaven, hell, and the afterlife.","The focus is often on trusting God with what comes next.","Living well now matters, regardless of uncertainty about details.","Beliefs about afterlife affect how Christians live today.","Many focus more on eternal life than on specific descriptions."],"verses":[{"ref":"John 14:1-3 NLT","text":"Don't let your hearts be troubled. Trust in God, and trust also in me. There is more than enough room in my Father's home. If this were not so, would I have told you that I am going to prepare a place for you? When everything is ready, I will come and get you, so that you will always be with me where I am."},{"ref":"Revelation 21:4 NLT","text":"He will wipe every tear from their eyes, and there will be no more death or sorrow or crying or pain. All these things are gone forever."}],"quiz":[{"type":"mc","q":"Christians believe about death:","options":["It is not the end because of resurrection","It is the absolute end","It is unknowable"],"correct":0,"explanation":"Resurrection hope changes Christian perspective on death."},{"type":"tf","q":"All Christians describe the afterlife exactly the same way.","correct":false,"explanation":"False — traditions differ on many details."},{"type":"tf","q":"How we live now matters in Christian belief.","correct":true,"explanation":"True — living well now is emphasized."},{"type":"mc","q":"Christian teaching on afterlife focuses on:","options":["Trusting God with what comes next","Exact descriptions","Avoiding the topic"],"correct":0,"explanation":"Trust is central more than exact maps."},{"type":"tf","q":"Different traditions have different ideas about heaven and hell.","correct":true,"explanation":"True — interpretations vary significantly."}]},{"id":24,"title":"Holiness and Living Well","purpose":"Explore what it means to live a holy or good life.","study":["Holiness does not mean being perfect or superior.","It means being set apart for God and trying to live with integrity.","Living well includes both personal faith and treating others fairly.","Christians believe the Holy Spirit helps transform life over time.","Small daily choices reflect and build bigger values.","Holiness is not about judgment but about becoming your best self."],"verses":[{"ref":"1 Peter 1:15-16 NLT","text":"But now you must be holy in everything you do, just as God—who chose you to be his children—is holy. For the Scriptures say, 'You must be holy because I am holy.'"},{"ref":"Colossians 3:12-14 NLT","text":"Since God chose you to be the holy people he loves most, you must clothe yourselves with tenderhearted mercy, kindness, humility, gentleness, and patience. Make allowance for each other's faults, and forgive anyone who offends you. Remember, the Lord forgave you, so you must forgive others. Most importantly, wrap yourself in the bond of love, which binds everything together in perfect unity."}],"quiz":[{"type":"mc","q":"Holiness means:","options":["Living with integrity for God's purpose","Being perfect","Being superior to others"],"correct":0,"explanation":"Holiness is about purpose and integrity, not perfection."},{"type":"tf","q":"Small daily choices reflect bigger values.","correct":true,"explanation":"True — daily actions shape who we become."},{"type":"mc","q":"The Holy Spirit's role includes:","options":["Helping transform life over time","Forcing instant change","Judging people harshly"],"correct":0,"explanation":"The Spirit works gradually in transformation."},{"type":"tf","q":"Living well includes both faith and treating others fairly.","correct":true,"explanation":"True — both are connected in Christian teaching."},{"type":"tf","q":"Holiness is about judgment and superiority.","correct":false,"explanation":"False — it is about becoming your best self."}]},{"id":25,"title":"Questions and Doubts Are Normal","purpose":"Affirm that questioning is part of faith, not opposed to it.","study":["Many people think doubt means weak faith. This is not true.","The Bible includes people who struggled and questioned.","Asking hard questions shows you are thinking seriously.","Faith and doubt can exist together.","Honest inquiry is better than pretending certainty.","God is not threatened by questions."],"verses":[{"ref":"Mark 9:24 NLT","text":"The father instantly cried out, 'I do believe, but help me overcome my unbelief!'"},{"ref":"Psalm 42:5 NLT","text":"Why am I discouraged? Why is my heart so sad? I will put my hope in God! I will praise him again— my God and my Savior."}],"quiz":[{"type":"tf","q":"Doubt means weak faith.","correct":false,"explanation":"False — doubt and faith can coexist."},{"type":"mc","q":"The Bible shows:","options":["People who questioned and struggled","Everyone with certainty","Only perfect believers"],"correct":0,"explanation":"Biblical figures experience doubt and struggle."},{"type":"tf","q":"Asking hard questions shows you are thinking seriously.","correct":true,"explanation":"True — inquiry is part of growing faith."},{"type":"mc","q":"God responds to questions with:","options":["Openness, not threat","Punishment for asking","Silence"],"correct":0,"explanation":"God is not threatened by honest questions."},{"type":"tf","q":"Honest inquiry is better than pretending certainty.","correct":true,"explanation":"True — authenticity matters in faith."}]},{"id":26,"title":"Different Christian Traditions","purpose":"Explain why Christians have different practices and beliefs.","study":["Christians share core beliefs but practice in different ways.","Traditions like Catholic, Orthodox, and Protestant developed historically.","Within each, there are more specific groups with different emphasis.","Differences are about practice, culture, and understanding, not usually salvation.","Learning about different traditions helps understanding.","Respect for differences is important in modern Christianity."],"verses":[{"ref":"1 Corinthians 12:12-13 NLT","text":"The human body has many parts, but the many parts make up one whole body. So it is with the body of Christ. Some of us are Jews, some are Gentiles, some are slaves, and some are free. But we have all been baptized into one body by one Spirit, and we all share the same Spirit."},{"ref":"John 17:20-21 NLT","text":"I am praying not only for these disciples but also for all who will ever believe in me through their message. I pray that they will all be one, just as you and I are one— as you are in me, Father, and I am in you. And may they be brought into complete unity so the world will know that you sent me and that you love them as much as you love me."}],"quiz":[{"type":"mc","q":"Christian traditions differ in:","options":["Practice and emphasis, not core faith","Core beliefs entirely","Nothing at all"],"correct":0,"explanation":"Traditions share core beliefs but practice differently."},{"type":"tf","q":"All Christians practice exactly the same way.","correct":false,"explanation":"False — significant diversity exists."},{"type":"mc","q":"Learning about different traditions:","options":["Helps understanding and respect","Is unnecessary","Should be avoided"],"correct":0,"explanation":"Understanding differences promotes respect."},{"type":"tf","q":"Christians can respect differences while keeping their own beliefs.","correct":true,"explanation":"True — diversity and conviction can coexist."},{"type":"tf","q":"Differences in tradition usually affect salvation.","correct":false,"explanation":"False — most traditions share core salvation beliefs."}]},{"id":27,"title":"Serving Others","purpose":"Understand Christian teaching on service and helping.","study":["Jesus taught by example, serving others.","Christians see service as expressing faith and love.","Service includes both direct help and working for change.","Everyone can serve in some way, using their gifts.","Service transforms both the helper and the helped.","Many Christian organizations exist to serve communities."],"verses":[{"ref":"Matthew 5:16 NLT","text":"In the same way, let your good deeds shine out for all to see, so that everyone will praise your heavenly Father."},{"ref":"Galatians 5:13 NLT","text":"For you have been called to live in freedom, my brothers and sisters. But don't use your freedom to satisfy your sinful nature. Instead, use your freedom to serve one another in love."},{"ref":"1 Peter 4:10 NLT","text":"God has given each of you a gift from his great variety of spiritual gifts. Use them well to serve one another."}],"quiz":[{"type":"tf","q":"Jesus taught service by example.","correct":true,"explanation":"True — his life demonstrated service."},{"type":"mc","q":"Service includes:","options":["Direct help and working for change","Only prayer","Thinking about helping"],"correct":0,"explanation":"Real service takes action."},{"type":"tf","q":"Only special people can serve.","correct":false,"explanation":"False — everyone can serve using their gifts."},{"type":"mc","q":"Service transforms:","options":["Both helper and helped","Only the helped","Nobody"],"correct":0,"explanation":"Service changes those who serve and those who are served."},{"type":"tf","q":"Christian organizations often focus on service.","correct":true,"explanation":"True — many exist to help communities."}]},{"id":28,"title":"Hope and Resurrection","purpose":"Explore Christian hope rooted in resurrection and Jesus.","study":["Christian hope is not wishful thinking but trust in God's character.","Resurrection hope means believing in victory over death.","This hope does not depend on current circumstances.","Hope is active, inspiring people to work for better futures.","Many Christians throughout history have faced hardship with hope.","Hope is a gift that can be discovered and deepened."],"verses":[{"ref":"Romans 8:24-25 NLT","text":"We were given this hope when we were saved. (If we already have something, we don't need to hope for it. But if we look forward to something we don't yet have, we must wait patiently and confidently.) And the Holy Spirit helps us in our weakness. For example, we don't know what God wants us to pray for. But the Holy Spirit prays for us with groanings that cannot be expressed in words."},{"ref":"Colossians 1:27 NLT","text":"For God wanted them to know that the riches and glory of Christ are for you Gentiles, too. And this is the secret: Christ lives in you. This gives you assurance of sharing his glory."}],"quiz":[{"type":"mc","q":"Christian hope is:","options":["Trust in God's character, not wishful thinking","Pretending problems don't exist","Only for lucky people"],"correct":0,"explanation":"Christian hope is based on faith in God."},{"type":"tf","q":"Hope depends on current circumstances.","correct":false,"explanation":"False — Christian hope transcends circumstances."},{"type":"mc","q":"Resurrection hope means:","options":["Believing in victory over death","Avoiding death entirely","Pretending death is not real"],"correct":0,"explanation":"It is faith in God's power over death."},{"type":"tf","q":"Hope is active and inspires action.","correct":true,"explanation":"True — hope motivates people to work for good."},{"type":"tf","q":"Many Christians have faced hardship with hope.","correct":true,"explanation":"True — history shows this repeatedly."}]},{"id":29,"title":"Christian Practice: Wisdom for Daily Life","purpose":"Gather practical wisdom for living as a Christian.","study":["Christian living involves practical choices about family, work, and relationships.","The Bible offers wisdom without being rigid about specifics.","Seeking advice from trusted people is wise.","Prayer and reflection help make difficult decisions.","Living out faith means making it real in your actual life.","Mistakes and learning are part of the journey."],"verses":[{"ref":"James 1:22 NLT","text":"But don't just listen to God's word. You must do what it says. Otherwise, you are only fooling yourselves."},{"ref":"Proverbs 11:14 NLT","text":"Without guidance, people fall, but with many advisers there is safety."},{"ref":"Philippians 4:8 NLT","text":"And now, dear brothers and sisters, one final thing. Fix your thoughts on what is true, and honorable, and right, and pure, and lovely, and admirable. Think about things that are excellent and worthy of praise."}],"quiz":[{"type":"tf","q":"Christian practice is lived out in daily choices.","correct":true,"explanation":"True — faith becomes real in actual life."},{"type":"mc","q":"The Bible offers:","options":["Wisdom without rigid rules","Detailed answers for everything","No practical guidance"],"correct":0,"explanation":"Scripture provides guidance with flexibility."},{"type":"tf","q":"Seeking advice is unwise.","correct":false,"explanation":"False — seeking counsel is wise."},{"type":"mc","q":"Making difficult decisions includes:","options":["Prayer, reflection, and counsel","Acting without thinking","Avoiding decisions"],"correct":0,"explanation":"Real discernment involves multiple practices."},{"type":"tf","q":"Mistakes are part of the Christian journey.","correct":true,"explanation":"True — learning happens through experience."}]},{"id":30,"title":"Your Journey: Starting and Growing in Faith","purpose":"Encourage and guide your personal faith journey.","study":["Your faith journey is personal and unique.","There is no perfect time to start or perfect way to believe.","Growing takes time, patience, and willingness to learn.","Community, Scripture, prayer, and reflection all help.","You are invited to explore and decide for yourself.","This course ends, but your journey continues."],"verses":[{"ref":"Proverbs 27:12 NLT","text":"The prudent see danger and take refuge, but the simple keep going and pay the penalty."},{"ref":"Joshua 1:8 NLT","text":"Keep this Book of the Law always on your lips; meditate on it day and night, so that you may be careful to do everything written in it. Then you will be prosperous and successful."},{"ref":"Psalm 25:4-5 NLT","text":"Show me the right path, O Lord; point out the road for me to follow. Lead me by your truth and teach me, for you are the God who saves me. All day long I put my hope in you."}],"quiz":[{"type":"tf","q":"Your faith journey must look like someone else's.","correct":false,"explanation":"False — your journey is unique to you."},{"type":"mc","q":"Growing in faith:","options":["Takes time and patience","Happens instantly","Is not possible"],"correct":0,"explanation":"Growth is gradual and continuous."},{"type":"tf","q":"Community helps faith grow.","correct":true,"explanation":"True — others support and encourage us."},{"type":"mc","q":"You are invited to:","options":["Explore and decide for yourself","Follow exactly what others say","Avoid all thinking"],"correct":0,"explanation":"Personal exploration and decision are central."},{"type":"tf","q":"This course is just a beginning.","correct":true,"explanation":"True — your journey continues beyond this course."}]}]
